a52dec
aalib
abseil-cpp
accounts-qml-module
accountsservice
acl
adobe-source-code-pro-fonts
adobe-source-han-sans-otc-fonts
adwaita-cursors
adwaita-icon-theme
aha
akonadi
akonadi-calendar
akonadi-contacts
akonadi-import-wizard
akonadi-mime
akonadi-notes
akonadi-search
alpm_octopi_utils
alsa-card-profiles
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
aom
appmenu-gtk-module
appstream
appstream-qt
archlinux-keyring
argon2
aribb25
ark
asciidoc
at-spi2-core
atkmm
attica
attr
audiofile
audit
auto-cpufreq
autoconf
autoconf-archive
automake
avahi
awesome-terminal-fonts
baloo
baloo-widgets
base
bash
bash-completion
bc
binutils
bison
blas
bleachbit
bluedevil
bluez
bluez-libs
bluez-qt
bolt
boost
boost-libs
box2d
breeze
breeze-gtk
breeze-icons
brotli
btrfs-progs
bubblewrap
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
calendarsupport
cantarell-fonts
cantata
capnproto
cblas
cdparanoia
celluloid
cfitsio
chromaprint
chromium
chrpath
cider-bin
cifs-utils
clash-for-windows-electron-bin
clash-geoip
clash-premium-bin
clucene
confuse
convertlit
coreutils
cpufreqctl
cpupower
cronie
cryptsetup
cups
cups-filters
curl
cython
dav1d
db
dbus
dbus-glib
dbus-python
dconf
dconf-editor
ddccontrol-db-git
debugedit
dee
default-cursors
desktop-file-utils
device-mapper
diffutils
discount
djvulibre
dkms
dmidecode
dmraid
dnsmasq
dnssec-anchors
docbook-xml
docbook-xsl
dolphin
dolphin-plugins
dosfstools
double-conversion
drkonqi
duktape
e2fsprogs
easyeffects
ebook-tools
editorconfig-core-c
efibootmgr
efitools
efivar
egl-wayland
eglexternalplatform
electron
electronic-wechat-uos-bin
elfutils
ell
enchant
eventviews
exiv2
expat
faac
faad2
fakeroot
faudio
fcitx5
fcitx5-breeze
fcitx5-configtool
fcitx5-gtk
fcitx5-material-color
fcitx5-pinyin-moegirl-rime
fcitx5-qt
fcitx5-rime
ffmpeg
ffmpeg4.4
fftw
file
filelight
filesystem
findutils
firefox
fish
flac
flacon
flashrom
flex
fluidsynth
fmt
fontconfig
frameworkintegration
freeglut
freetype2
frei0r-plugins
fribidi
ftgl
fuse-common
fuse2
fuse3
fwupd
fwupd-efi
gavl
gawk
gc
gcab
gcc
gcc-libs
gcr
gcr-4
gd
gdb
gdb-common
gdbm
gdk-pixbuf2
geoclue
geocode-glib
geocode-glib-2
geocode-glib-common
gettext
gflags
ghostscript
giflib
git
gjs
glew
glew1.10
glfw-wayland
glib-networking
glib2
glib2-docs
glibc
glibmm
glm
glslang
glu
gmp
gnome-common
gnome-sound-recorder
gnome-weather
gnu-free-fonts
gnupg
gnustep-base
gnutls
gobject-introspection
gobject-introspection-runtime
google-glog
gperftools
gpgme
gpm
gptfdisk
grantlee
grantleetheme
graphene
graphicsmagick
graphite
graphviz
grep
groff
gsasl
gsettings-desktop-schemas
gsfonts
gsl
gsm
gspell
gssdp
gst-libav
gst-plugin-opencv
gst-plugin-pipewire
gst-plugin-qmlgl
gst-plugin-va
gst-plugins-bad
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gst-plugins-ugly
gstreamer
gstreamer-vaapi
gtk-doc
gtk-update-icon-cache
gtk2
gtk3
gtk4
gtkmm3
gts
guile
gupnp
gupnp-igd
gvfs
gwenview
gzip
harfbuzz
harfbuzz-icu
hdf5
hdparm
hicolor-icon-theme
hidapi
highway
hmcl-bin
htop
hunspell
hwdata
hwloc
hyphen
iana-etc
icu
ijs
imagemagick
imath
imlib2
incidenceeditor
inetutils
iniparser
inkscape
intltool
iproute2
iptables
iputils
iso-codes
itstool
iw
iwd
jansson
jasper
java-runtime-common
jbig2dec
jemalloc
jq
js102
js91
json-c
json-glib
jsoncpp
kaccounts-integration
kactivities
kactivities-stats
kactivitymanagerd
kaddressbook
kamera
kamoso
kapidox
karchive
kate
kauth
kbd
kbookmarks
kcalc
kcalendarcore
kcalutils
kcmutils
kcodecs
kcolorchooser
kcolorpicker
kcompletion
kconfig
kconfigwidgets
kcontacts
kcoreaddons
kcrash
kcron
kdav
kdbusaddons
kde-cli-tools
kde-dev-utils
kde-gtk-config
kde-rounded-corners
kdeclarative
kdecoration
kded
kdelibs4support
kdenlive
kdepim-addons
kdepim-runtime
kdeplasma-addons
kdesu
kdiagram
kdialog
kdnssd
kdoctools
kdsoap
kdsoap-ws-discovery-client
keditbookmarks
kemoticons
keyutils
kfilemetadata
kgamma5
kget
kglobalaccel
kguiaddons
kholidays
khotkeys
ki18n
kiconthemes
kidentitymanagement
kidletime
kimageannotator
kimageformats
kimap
kinfocenter
kinit
kio
kio-extras
kio-fuse
kio-zeroconf
kirigami2
kitemmodels
kitemviews
kitinerary
kjobwidgets
kjs
kldap
kleopatra
kmail
kmail-account-wizard
kmailtransport
kmbox
kmenuedit
kmime
kmod
knewstuff
knotifications
knotifyconfig
konsole
kontact
kontactinterface
korganizer
kotatogram-desktop-bin
kpackage
kparts
kpeople
kpimtextedit
kpipewire
kpkpass
kplotting
kpmcore
kpty
kquickcharts
krb5
krfb
kross
krunner
kscreen
kscreenlocker
kservice
ksmtp
ksshaskpass
ksystemlog
ksystemstats
ktexteditor
ktextwidgets
ktnef
kunitconversion
kuserfeedback
kvantum
kwallet
kwallet-pam
kwalletmanager
kwayland
kwayland-integration
kwidgetsaddons
kwin
kwindowsystem
kwrited
kxmlgui
l-smash
lame
lapack
latte-dock-git
layer-shell-qt
lcms2
ldb
ldns
less
leveldb
lib2geom
lib32-acl
lib32-alsa-lib
lib32-alsa-plugins
lib32-at-spi2-core
lib32-attr
lib32-brotli
lib32-bzip2
lib32-cairo
lib32-colord
lib32-curl
lib32-dbus
lib32-dbus-glib
lib32-e2fsprogs
lib32-expat
lib32-faudio
lib32-flac
lib32-fontconfig
lib32-freeglut
lib32-freetype2
lib32-fribidi
lib32-gcc-libs
lib32-gdk-pixbuf2
lib32-gettext
lib32-giflib
lib32-glew1.10
lib32-glib-networking
lib32-glib2
lib32-glibc
lib32-glu
lib32-gmp
lib32-gnutls
lib32-gtk2
lib32-gtk3
lib32-harfbuzz
lib32-icu
lib32-imlib2
lib32-json-glib
lib32-keyutils
lib32-krb5
lib32-lcms2
lib32-libappindicator-gtk2
lib32-libasyncns
lib32-libcaca
lib32-libcanberra
lib32-libcap
lib32-libcups
lib32-libcurl-compat
lib32-libcurl-gnutls
lib32-libdatrie
lib32-libdbusmenu-glib
lib32-libdbusmenu-gtk2
lib32-libdrm
lib32-libelf
lib32-libepoxy
lib32-libffi
lib32-libgcrypt
lib32-libgcrypt15
lib32-libglvnd
lib32-libgpg-error
lib32-libice
lib32-libidn11
lib32-libidn2
lib32-libindicator-gtk2
lib32-libjpeg-turbo
lib32-libjpeg6-turbo
lib32-libldap
lib32-libltdl
lib32-libmikmod
lib32-libmodplug
lib32-libnl
lib32-libnm
lib32-libnsl
lib32-libogg
lib32-libpcap
lib32-libpciaccess
lib32-libpng
lib32-libpng12
lib32-libproxy
lib32-libpsl
lib32-libpulse
lib32-librsvg
lib32-librtmp0
lib32-libsm
lib32-libsndfile
lib32-libsoup
lib32-libssh2
lib32-libtasn1
lib32-libthai
lib32-libtheora
lib32-libtiff
lib32-libtiff4
lib32-libtirpc
lib32-libudev0-shim
lib32-libunistring
lib32-libunwind
lib32-libusb
lib32-libva
lib32-libva-mesa-driver
lib32-libvdpau
lib32-libvorbis
lib32-libvpx1.3
lib32-libwebp
lib32-libwrap
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcomposite
lib32-libxcrypt
lib32-libxcursor
lib32-libxdamage
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxft
lib32-libxi
lib32-libxinerama
lib32-libxkbcommon
lib32-libxml2
lib32-libxmu
lib32-libxrandr
lib32-libxrender
lib32-libxshmfence
lib32-libxslt
lib32-libxss
lib32-libxt
lib32-libxtst
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-mpg123
lib32-ncurses
lib32-nettle
lib32-nspr
lib32-nss
lib32-nvidia-utils
lib32-ocl-icd
lib32-openal
lib32-openssl
lib32-openssl-1.1
lib32-opus
lib32-p11-kit
lib32-pam
lib32-pango
lib32-pcre
lib32-pcre2
lib32-pipewire
lib32-pixman
lib32-readline
lib32-rest
lib32-sdl12-compat
lib32-sdl2
lib32-sdl2_image
lib32-sdl2_mixer
lib32-sdl2_ttf
lib32-sdl_image
lib32-sdl_mixer
lib32-sdl_ttf
lib32-smpeg
lib32-sqlite
lib32-systemd
lib32-tdb
lib32-util-linux
lib32-v4l-utils
lib32-vkd3d
lib32-vulkan-icd-loader
lib32-vulkan-mesa-layers
lib32-vulkan-radeon
lib32-wayland
lib32-xz
lib32-zlib
lib32-zstd
libabw
libaccounts-glib
libaccounts-qt
libadwaita
libaec
libaio
libakonadi
libao
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libavif
libavtp
libb2
libblockdev
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcaca
libcamera
libcanberra
libcap
libcap-ng
libcbor
libcddb
libcdio
libcdio-paranoia
libcdr
libcloudproviders
libcolord
libcups
libcurl-compat
libcurl-gnutls
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk2
libdbusmenu-gtk3
libdbusmenu-qt5
libdbusmenu-qt6
libdc1394
libdca
libde265
libdmtx
libdrm
libdv
libdvbpsi
libdvdcss
libdvdnav
libdvdread
libe-book
libebml
libebur128
libedit
libelf
libepoxy
libepubgen
libetonyek
libevdev
libevent
libexif
libexttextcat
libfdk-aac
libffi
libfontenc
libfreeaptx
libfreehand
libftdi
libgcrypt
libgcrypt15
libgee
libglvnd
libgme
libgnomekbd
libgoom2
libgpg-error
libgphoto2
libgravatar
libgudev
libgusb
libgweather-4
libhandy
libheif
libibus
libical
libice
libid3tag
libidn
libidn11
libidn2
libiec61883
libimagequant
libimobiledevice
libindicator-gtk2
libindicator-gtk3
libinih
libinput
libinstpatch
libisl
libixion
libjcat
libjpeg-turbo
libjpeg6-turbo
libjxl
libkate
libkdcraw
libkdepim
libkexiv2
libkgapi
libkleo
libkolabxml
libksba
libkscreen
libksieve
libksysguard
libktorrent
liblangtag
libldac
libldap
libldap24
liblqr
liblrdf
libltc
liblzf
libmad
libmanette
libmatroska
libmbim
libmd
libmfx
libmicrodns
libmikmod
libmm-glib
libmms
libmng
libmnl
libmodplug
libmpc
libmpcdec
libmpdclient
libmpeg2
libmspub
libmtp
libmusicbrainz5
libmwaw
libmythes
libndp
libnetfilter_conntrack
libnewt
libnfnetlink
libnfs
libnftnl
libnghttp2
libnice
libnl
libnm
libnma
libnma-common
libnotify
libnsl
libnumbertext
libodfgen
libogg
libomxil-bellagio
libopenmpt
liborcus
libp11-kit
libpackagekit-glib
libpagemaker
libpaper
libpcap
libpciaccess
libpgm
libphonenumber
libpipeline
libplacebo
libplist
libpng
libpng12
libproxy
libpsl
libpulse
libqaccessibilityclient
libqalculate
libqmi
libqrtr-glib
libqxp
libraqm
libraw
libraw1394
libreoffice-fresh
libreoffice-fresh-zh-cn
librevenge
librime
librime-data
librsvg
librtmp0
libsamplerate
libsasl
libseccomp
libsecret
libshout
libsidplay
libsidplayfp
libsigc++
libsigc++-3.0
libsm
libsmbios
libsndfile
libsodium
libsoup
libsoup3
libsoxr
libspectre
libsrtp
libssh
libssh2
libstaroffice
libstemmer
libsysprof-capture
libtar
libtasn1
libteam
libthai
libtheora
libtiff
libtiff4
libtiger
libtirpc
libtommath
libtool
libtorrent-rasterbar
libtpms
libudev0-shim
libunistring
libunity
libunwind
libupnp
liburcu
liburing
libusb
libusb-compat
libusbmuxd
libutempter
libva
libva-mesa-driver
libva-utils
libvdpau
libverto
libvisio
libvisual
libvncserver
libvorbis
libvpx
libvpx1.3
libwacom
libwebp
libwireplumber
libwpd
libwpe
libwpg
libwps
libwrap
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmlb
libxmu
libxnvctrl
libxpm
libxpresent
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzip
libzmf
licenses
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-whence
linux-headers
lirc
live-media
llvm-libs
lm_sensors
lmdb
lpsolve
lsb-release
lsof
lsp-plugins
lua
lua52
luajit
lv2
lvm2
lxc
lz4
lzo
m4
mailcap
mailcommon
mailimporter
mailutils
make
mallard-ducktype
man-db
mariadb
mariadb-clients
mariadb-libs
marisa
markdownpart
material-cursors-git
mbedtls
mbox-importer
md4c
mdadm
media-player-info
mesa
mesa-utils
mesa-vdpau
meson
messagelib
metis
microsoft365-chromium
milou
minizip
mjpegtools
mkinitcpio
mkinitcpio-busybox
mlt
mobile-broadband-provider-info
modemmanager
modemmanager-qt
moreutils
movit
mpd
mpfr
mpg123
mpv
mtdev
mtools
mujs
nano
nasm
ncurses
ndctl
neofetch
neon
net-tools
netease-cloud-music-dl-git
netpbm
nettle
network-manager-applet
networkmanager
networkmanager-qt
nftables
ninja
nm-connection-editor
noise-suppression-for-voice
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-sc
npth
nspr
nss
nss-mdns
nvidia
nvidia-prime
nvidia-settings
nvidia-utils
nvme-cli
obs-gstreamer
obs-studio
ocl-icd
octopi
okular
oniguruma
openal
opencc
opencl-headers
opencore-amr
opencv
openexr
openjpeg2
openmpi
openpmix
openssh
openssl
openssl-1.0
openssl-1.1
opentimelineio
opus
opusfile
p11-kit
p7zip
packagekit
packagekit-qt5
pacman
pacman-contrib
pacman-mirrorlist
pahole
pam
pam-python
pambase
pango
pangomm
papirus-icon-theme
parted
partitionmanager
patch
patchelf
pciutils
pcre
pcre2
pcsclite
perl
perl-clone
perl-encode-locale
perl-error
perl-file-listing
perl-html-parser
perl-html-tagset
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-io-tty
perl-ipc-run
perl-libwww
perl-lwp-mediatypes
perl-mailtools
perl-net-http
perl-time-duration
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
perl-xml-parser
phonon-qt5
phonon-qt5-vlc
pim-data-exporter
pim-sieve-editor
pimcommon
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkgconf
pkgfile
plasma-browser-integration
plasma-desktop
plasma-disks
plasma-firewall
plasma-framework
plasma-integration
plasma-nm
plasma-pa
plasma-systemmonitor
plasma-thunderbolt
plasma-wayland-protocols
plasma-wayland-session
plasma-workspace
plasma-workspace-wallpapers
plotutils
plymouth
polkit
polkit-kde-agent
polkit-qt5
poppler
poppler-data
poppler-glib
poppler-qt5
popt
portaudio
postgresql-libs
potrace
powerdevil
powertop
ppp
preloader-signed
print-manager
prison
procps-ng
projectm
protobuf
protobuf-c
psmisc
pstoedit
pugixml
purpose
qbittorrent-qt5
qca-qt5
qcustomplot
qgpgme
qhexedit2
qpdf
qqc2-desktop-style
qrencode
qscintilla-qt5
qt-gstreamer
qt5-base
qt5-declarative
qt5-graphicaleffects
qt5-imageformats
qt5-location
qt5-multimedia
qt5-networkauth
qt5-quickcontrols
qt5-quickcontrols2
qt5-script
qt5-sensors
qt5-speech
qt5-svg
qt5-tools
qt5-translations
qt5-wayland
qt5-webchannel
qt5-webengine
qt5-x11extras
qt6-base
qt6-declarative
qt6-multimedia
qt6-multimedia-gstreamer
qt6-svg
qt6-translations
qt6-wayland
qtermwidget
qtkeychain-qt5
ragel
raptor
rasqal
rav1e
re2
readline
redland
reflector
rest
rime-bopomofo
rime-cangjie
rime-essay
rime-luna-pinyin
rime-prelude
rime-stroke
rime-terra-pinyin
rnnoise
rocketchat-client-electron-bin
rsync
rtkit
rtmpdump
rubberband
run-parts
rustup
sbc
sbsigntools
sddm
sddm-kcm
sdl12-compat
sdl2
sdl2_image
sdl2_mixer
sdl2_ttf
sdl_image
sdl_mixer
sdl_ttf
sed
serd
shaderc
shadow
shared-mime-info
shim-signed
signon-kwallet-extension
signon-plugin-oauth2
signon-ui
signond
slang
slop
smartmontools
smbclient
smpeg
snappy
socat
solid
sonnet
sord
sound-theme-freedesktop
soundtouch
source-highlight
spandsp
spectacle
speex
speexdsp
spirv-tools
sqlcipher
sqlite
sqlitebrowser
sratom
srt
steam
steam-native-runtime
sudo
svt-av1
svt-hevc
sweeper
syndication
syntax-highlighting
sysfsutils
system-config-printer
systemd
systemd-libs
systemd-sysvcompat
systemsettings
taglib
talloc
tar
tbb
tcl
tdb
tevent
texinfo
thin-provisioning-tools
threadweaver
timeshift
tk
tlp
tpm2-tss
tracker3
trash-cli
tslib
ttf-hack
ttf-liberation
turbostat
twolame
typora-free-cn
tzdata
uchardet
udisks2
ufw
unarchiver
unicode-cldr-annotations
unixodbc
unrar
unzip
upower
upscayl-bin
usb_modeswitch
usbmuxd
usbutils
util-linux
util-linux-libs
uxplay
v4l-utils
v4l2loopback-dkms
vala
vcdimager
vdpauinfo
vid.stab
virtualbox
virtualbox-ext-oracle
virtualbox-guest-iso
virtualbox-host-modules-arch
vkd3d
vlc
vmaf
volume_key
vte-common
vte3
vtk
vulkan-headers
vulkan-icd-loader
vulkan-mesa-layers
vulkan-radeon
vulkan-tools
wavpack
wayland
wayland-protocols
wayland-utils
waylandpp
webkit2gtk-4.1
webrtc-audio-processing
wget
which
whitesur-icon-theme
wildmidi
wine-mono
wine-staging
winetricks
wireless-regdb
wireless_tools
wireplumber
woff2
wpa_supplicant
wpebackend-fdo
wqy-bitmapfont
wqy-microhei
wqy-zenhei
x11-ssh-askpass
x264
x265
x86_energy_perf_policy
xapian-core
xapp
xcb-imdkit
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-kde
xdg-user-dirs
xdg-utils
xerces-c
xf86-input-libinput
xf86-video-nouveau
xfsprogs
xkeyboard-config
xmlsec
xorg-fonts-alias-misc
xorg-fonts-encodings
xorg-fonts-misc
xorg-server
xorg-server-common
xorg-server-xvfb
xorg-setxkbmap
xorg-xauth
xorg-xcursorgen
xorg-xdpyinfo
xorg-xhost
xorg-xinit
xorg-xkbcomp
xorg-xmessage
xorg-xmodmap
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xset
xorg-xsetroot
xorg-xwayland
xorgproto
xosd
xvidcore
xxhash
xz
yajl
yaml-cpp
yay-bin
yelp-tools
yelp-xsl
yq
zbar
zenity
zeromq
zimg
zita-convolver
zlib
zstd
zulu-jre-fx-bin
zvbi
zxing-cpp
zziplib
icalingua++
kwin-decoration-sierra-breeze-enhanced-git
unzip-natspec
p7zip-natspec
